ka2_2024/src/Documents/ПрочееОприходованиеТоваров/ПрочееОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрочееОприходованиеТоваров</name>
  <basedOn>Document.ВнутреннееПотребление</basedOn>
  <basedOn>Document.СписаниеОС</basedOn>
  <registerRecords>AccumulationRegister.ДвиженияПоНДС</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеДоходы</registerRecords>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварами</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПрослеживаемыеТоварыВСоставеОС</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТоваровОрганизаций</registerRecords>
  <registerRecords>InformationRegister.ИсправленияДокументов</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>InformationRegister.СуммыДокументовВВалютахУчета</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>InformationRegister.ОперацииСПрослеживаемымиТоварамиРасширенный</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеАктивыПассивы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоПрочимАктивамПассивам</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>AccumulationRegister.ПартииНДСКРаспределению</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.НДСПредъявленный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюОтчетовКомитенту</registerRecords>
  <registerRecords>AccumulationRegister.ПартииРасходовНаСебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНМатериалы</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <registerRecords>AccumulationRegister.РасходыПриУСНТовары</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПродаж</registerRecords>
  <registerRecords>AccumulationRegister.КнигаУчетаДоходовИРасходов</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураНоменклатура</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.НДСЗаписиКнигиПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ТМЦВЭксплуатации</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПроизводственныхЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <registerRecords>AccumulationRegister.ПартииЗатратНаВыпуск</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаполненияМногооборотнойТары</name>
    <type>
      <types>EnumRef.СостоянияЗаполненияМногооборотнойТары</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВнутреннееПотребление</types>
      <types>DocumentRef.СписаниеОС</types>
      <types>DocumentRef.СписаниеОС2_4</types>
      <types>DocumentRef.ИнвентаризацияТМЦВЭксплуатации</types>
      <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <type>
      <types>EnumRef.ВариантыПриемкиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Исправление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправляемыйДокумент</name>
    <type>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступления</name>
    <comment>Планируемая дата приемки товаров на складе</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходовВыбытие</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходовДоходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
        <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>СписаниеНаРасходы</name>
      <type>
        <types>DocumentRef.ВнутреннееПотребление</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийОтправитель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерийПолучатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИнвентарныйНомер</name>
      <type>
        <types>DefinedType.ИнвентарныйНомерТМЦВЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииТМЦВЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗавершенияЭксплуатации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <type>
        <types>Characteristic.СтатьиДоходов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидыЗапасов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкаСчетовУчета</name>
      <type>
        <types>CatalogRef.НастройкиСчетовУчетаПрочихОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОбъектыЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВидыЗапасов</name>
    <attributes>
      <name>ВидЗапасов</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПоРНПТ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>23</precision>
          <scale>11</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗапасовОтгрузки</name>
      <type>
        <types>CatalogRef.ВидыЗапасов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализации</name>
      <type>
        <types>DocumentRef.ВнутреннееПотребление</types>
        <types>DocumentRef.ДвижениеПродукцииИМатериалов</types>
        <types>DocumentRef.ПередачаМатериаловВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатурыОтгрузки</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ka2_2024/src/CommonModules/ТМЦВЭксплуатацииКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции подсистемы ТМЦ в эксплуатации.
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// 
// Параметры:
//  ТекущаяСтрока - Структура - 
//  СтруктураДействий - Структура - 
//  КэшированныеЗначения - Структура - 
// 
// Возвращаемое значение:
//  Булево -
Функция НеобходимВызовСервераДляОбработкиСтрокиТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		Если ЗначениеЗаполнено(ТекущаяСтрока.КатегорияЭксплуатации)
			И КэшированныеЗначения.ПризнакиКатегорииЭксплуатации.Получить(ТекущаяСтрока.КатегорияЭксплуатации) = Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// См. ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения, ДополнительныеПараметрыЗаполнения = Неопределено) Экспорт
	
	ЗаполнитьПризнакиКатегорииЭксплуатации(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	
КонецПроцедуры

// Обрабатывает строку при изменении категории эксплуатации.
// 
// Параметры:
//  ДанныеСтроки - ДанныеФормыСтруктура, Массив из ДанныеФормыСтруктура - Текущая строка.
//  ТабличнаяЧасть - ДанныеФормыКоллекция - Табличная часть.
//  СтруктураДействий - Структура - Структура действий.
//	ПолеКоличество - Строка - Поле "Количество".
Процедура ОбработатьСтрокуПриИзмененииКатегорииЭксплуатации(ДанныеСтроки, ТабличнаяЧасть, СтруктураДействий = Неопределено, ПолеКоличество = "") Экспорт
	
	Если ПолеКоличество = "" Тогда
		ПолеКоличество = "КоличествоУпаковок";
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ДанныеСтроки", ДанныеСтроки);
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("СтруктураДействий", СтруктураДействий);
	ДополнительныеПараметры.Вставить("ПолеКоличество", ПолеКоличество);

	Если ТипЗнч(ДанныеСтроки) = Тип("Массив") Тогда
		
		ТребуетсяРазбитьСтроки = Ложь;
		
		Для Каждого ИДСтроки Из ДанныеСтроки Цикл
			ТекущаяСтрока = ТабличнаяЧасть.НайтиПоИдентификатору(ИДСтроки);
		 	Если ЗначениеЗаполнено(ТекущаяСтрока.КатегорияЭксплуатации) 
				И ТекущаяСтрока.ИнвентарныйУчет
				И ТекущаяСтрока[ПолеКоличество] > 1 Тогда
		 		ТребуетсяРазбитьСтроки = Истина;
		 		Прервать
		 	КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		ТребуетсяРазбитьСтроки = 
			ЗначениеЗаполнено(ДанныеСтроки.КатегорияЭксплуатации) 
			И ДанныеСтроки.ИнвентарныйУчет
			И ДанныеСтроки[ПолеКоличество] > 1;
			
	КонецЕсли;
	
	Если ТребуетсяРазбитьСтроки Тогда

		Если ТипЗнч(ДанныеСтроки) = Тип("Массив")
			И ДанныеСтроки.Количество() > 1 Тогда
			
			ТекстВопроса = НСтр("ru = 'В категории эксплуатации включен инвентарный учет, количество должно быть равным 1.
								|Разбить строки или установить количество равным 1?'");
								
			ТекстКнопки = НСтр("ru = 'Разбить строки'");
			
		Иначе
			
			ТекстВопроса = НСтр("ru = 'В категории эксплуатации включен инвентарный учет, количество должно быть равным 1.
								|Разбить строку или установить количество равным 1?'");
								
			ТекстКнопки = НСтр("ru = 'Разбить строку'");
			
		КонецЕсли;
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьСтрокуПриИзмененииКатегорииЭксплуатацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		СписокКнопок = Новый СписокЗначений();
		СписокКнопок.Добавить(КодВозвратаДиалога.Да, ТекстКнопки);
		СписокКнопок.Добавить(КодВозвратаДиалога.Нет, НСтр("ru = 'Изменить количество'"));
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, СписокКнопок);
		
	Иначе
		
		ОбработатьСтрокуПриИзмененииКатегорииЭксплуатацииЗавершение(КодВозвратаДиалога.Нет, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// 
// Параметры:
//  СтруктураПолейТЧ - Структура - Структура полей ТЧ
//  ТекущаяСтрока - Структура - Текущая строка
//  СтруктураДействий - Структура - Структура действий
//  ДополнительныеПараметрыЗаполнения - Структура - Дополнительные параметры заполнения
Процедура ДополнитьТекущуюСтрокуСтруктурой(СтруктураПолейТЧ, ТекущаяСтрока, СтруктураДействий, ДополнительныеПараметрыЗаполнения) Экспорт
	
	Если СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		СтруктураПолейТЧ.Вставить("КатегорияЭксплуатации");
		СтруктураПолейТЧ.Вставить("ИнвентарныйУчет");
		СтруктураПолейТЧ.Вставить("УчетПоФизЛицам");
		СтруктураПолейТЧ.Вставить("УчитыватьВВидеГрупповогоОС");
		СтруктураПолейТЧ.Вставить("СпособПогашенияСтоимостиБУ");
		СтруктураПолейТЧ.Вставить("СтатьяРасходов");
		СтруктураПолейТЧ.Вставить("СрокЭксплуатации");
	КонецЕсли;
	
КонецПроцедуры

// Обработчик команды заполнения категории эксплуатации в выделенных строках таблицы.
// 
// Параметры:
// 	ТабличнаяЧасть - ДанныеФормыКоллекция - Табличная часть.
// 	ВыделенныеСтроки - Массив из Число - Выделенные строки таблицы формы.
// 	ПараметрыВыбора - Структура - Параметры отбора.
// 	ОписаниеОповещенияПослеЗаполнения - ОписаниеОповещения - Описания оповещения, которое необходимо вызвать после заполнения.
//
Процедура ЗаполнитьКатегориюЭксплуатации(ТабличнаяЧасть, ВыделенныеСтроки, ПараметрыВыбора = Неопределено, ОписаниеОповещенияПослеЗаполнения = Неопределено) Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ОписаниеОповещенияПослеЗаполнения", ОписаниеОповещенияПослеЗаполнения);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьКатегориюЭксплуатацииЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Справочник.КатегорииЭксплуатации.ФормаВыбора", ПараметрыВыбора,,,,, ОписаниеОповещения);
	
КонецПроцедуры

//++ НЕ УТ

// Заполняет список выбора при авто подборе по инвентарному номеру.
// 
// Параметры:
//  Текст - Строка - Введенный текст.
//  ПараметрыПодбора - см. ТМЦВЭксплуатацииКлиентСервер.ПараметрыПодбораТМЦВЭксплуатации
//  ДанныеВыбора - СписокЗначений - Данные выбора.
//  СтандартнаяОбработка - Булево - Признак стандартной обработки события.
//
Процедура АвтоПодборПоИнвентарномуНомеру(Текст, ПараметрыПодбора, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	Если Не ЗначениеЗаполнено(Текст) Тогда
		Возврат;
	КонецЕсли;
	
	ОценкаПроизводительностиКлиент.ЗамерВремени("ТМЦВЭксплуатацииКлиент.АвтоПодборПоИнвентарномуНомеру");
	
	Если ПараметрыПодбора = Неопределено Тогда
		ПараметрыПодбора = ТМЦВЭксплуатацииКлиентСервер.ПараметрыПодбораТМЦВЭксплуатации();
	КонецЕсли;
	
	ПараметрыПодбора.ИнвентарныйНомерСодержит = Текст;
	ПараметрыПодбора.ВыбратьПервые = 10;
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	
	ТМЦВЭксплуатацииВызовСервера.ЗаполнитьДанныеВыбораПоИнвентарномуНомеру(
		ПараметрыПодбора, 
		ДанныеВыбора);
	
КонецПроцедуры

// Получает данные для печати и открывает форму для печати этикеток.
//
// Параметры:
//	ОписаниеКоманды - Структура - структура с описанием команды:
//	                    * Идентификатор - Строка - Может принимать значения "Этикетки";
//	                    * ОбъектыПечати - Массив - Объекты печати.
//
// Возвращаемое значение:
//	Неопределено - Ничего не возвращает.
//
Функция ПечатьЭтикетокТМЦВЭксплуатацииИзДокумента(ОписаниеКоманды) Экспорт
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Идентификатор", ОписаниеКоманды.Идентификатор);
	ПараметрыПечати.Вставить("ОбъектыПечати", ОписаниеКоманды.ОбъектыПечати);
	ПараметрыПечати.Вставить("ДополнительныеПараметры", Новый Структура("МенеджерПечати", ОписаниеКоманды.МенеджерПечати));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПечатьИзДокумента", ПараметрыПечати);
	
	ОткрытьФорму(
		"Обработка.ПечатьЭтикетокТМЦВЭксплуатации.Форма",
		ПараметрыФормы,
		ОписаниеКоманды.Форма,
		Новый УникальныйИдентификатор);
	
	Возврат Неопределено;
	
КонецФункции

// Обработчик команды заполнения физ. лица выделенных строках таблицы.
// 
// Параметры:
// 	ТабличнаяЧасть - ДанныеФормыКоллекция - Табличная часть.
// 	ВыделенныеСтроки - Массив из Число - Выделенные строки таблицы формы.
// 	ИмяПоляФизическоеЛицо - Строка - Имя поля содержащего физическое лицо.
//
Процедура ЗаполнитьФизическоеЛицо(ТабличнаяЧасть, ВыделенныеСтроки, ИмяПоляФизическоеЛицо = "ФизическоеЛицо") Экспорт
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ТабличнаяЧасть", ТабличнаяЧасть);
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	ДополнительныеПараметры.Вставить("ИмяПоляФизическоеЛицо", ИмяПоляФизическоеЛицо);
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьФизическоеЛицоЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	ПараметрыПодбора.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыПодбора.Вставить("МножественныйВыбор", Ложь);

	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыПодбора,,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//-- НЕ УТ

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Открывает додобор ТМЦ в эксплуатации.
// 
// Параметры:
//  ПараметрыФормы - Структура - Параметры формы
//	Форма - ФормаКлиентскогоПриложения - Форма
Процедура ПодобратьТМЦВЭксплуатации(ПараметрыФормы, Форма) Экспорт
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Документ.ПрочееОприходованиеТоваров.ФормаДокумента.Команда.ПодобратьТМЦВЭксплуатации");
	
	ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбораУТ";
	//++ НЕ УТ
	ИмяФормы = "Справочник.ПартииТМЦВЭксплуатации.Форма.ФормаПодбора";
	//-- НЕ УТ
	
	ОткрытьФорму(ИмяФормы, ПараметрыФормы, Форма);
	
КонецПроцедуры

Процедура ЗаполнитьПризнакиКатегорииЭксплуатации(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	
	Если НЕ СтруктураДействий.Свойство("ЗаполнитьПризнакиКатегорииЭксплуатации") Тогда
		Возврат;
	КонецЕсли;
		
	СтруктураПризнаков = КэшированныеЗначения.ПризнакиКатегорииЭксплуатации.Получить(
		ТекущаяСтрока.КатегорияЭксплуатации);
		
	Если СтруктураПризнаков <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтруктураПризнаков);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСтрокуПриИзмененииКатегорииЭксплуатацииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да 
		И РезультатВопроса <> КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	ТабличнаяЧасть = ДополнительныеПараметры.ТабличнаяЧасть; // ТабличнаяЧасть
	ПолеКоличество = ДополнительныеПараметры.ПолеКоличество;
	Разбить = (РезультатВопроса = КодВозвратаДиалога.Да);
	СтруктураДействий = ДополнительныеПараметры.СтруктураДействий; // Структура
	
	ЕстьУпаковка = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "Упаковка");
	
	Если ТипЗнч(ДанныеСтроки) = Тип("Массив") Тогда
		
		СписокСтрок = Новый Массив;
		Для Каждого ИДСтроки Из ДанныеСтроки Цикл
			ТекущаяСтрока = ТабличнаяЧасть.НайтиПоИдентификатору(ИДСтроки);
			СписокСтрок.Добавить(ТекущаяСтрока);
		КонецЦикла;
		
	Иначе
		СписокСтрок = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеСтроки);
	КонецЕсли;
	
	КэшированныеЗначения = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	Для Каждого ТекущаяСтрока Из СписокСтрок Цикл
		
		Если ЗначениеЗаполнено(ТекущаяСтрока.КатегорияЭксплуатации) 
			И ТекущаяСтрока.ИнвентарныйУчет Тогда
				
			КоличествоВСтроке = ТекущаяСтрока.Количество - 1;
			
			ТекущаяСтрока[ПолеКоличество] = 1;
			ТекущаяСтрока.Количество = 1;
			
			Если ЕстьУпаковка Тогда
				ТекущаяСтрока.Упаковка = ПредопределенноеЗначение("Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка");
			КонецЕсли;
			
			Если СтруктураДействий <> Неопределено Тогда
				ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(
					ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
			КонецЕсли;
			
			Если Разбить Тогда
				
				Пока КоличествоВСтроке > 0 Цикл
					
					НоваяСтрока = ТабличнаяЧасть.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
					НоваяСтрока.ИнвентарныйНомер = "";
					
					Если СтруктураДействий <> Неопределено Тогда
						ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(
							ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
					КонецЕсли;
					
					КоличествоВСтроке = КоличествоВСтроке - 1;
					
				КонецЦикла;
				
			КонецЕсли;
			
		Иначе
			
			Если НЕ ТекущаяСтрока.ИнвентарныйУчет Тогда
				ТекущаяСтрока.ИнвентарныйНомер = "";
			КонецЕсли;
	
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьКатегориюЭксплуатацииЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = ДополнительныеПараметры.ТабличнаяЧасть;
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	
	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
		ДанныеСтроки.КатегорияЭксплуатации = Результат;
		
	КонецЦикла;
	
	Если ДополнительныеПараметры.ОписаниеОповещенияПослеЗаполнения <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОписаниеОповещенияПослеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

//++ НЕ УТ

Процедура ЗаполнитьФизическоеЛицоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабличнаяЧасть = ДополнительныеПараметры.ТабличнаяЧасть;
	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	ИмяПоляФизическоеЛицо = ДополнительныеПараметры.ИмяПоляФизическоеЛицо;
	
	Для каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		
		ДанныеСтроки = ТабличнаяЧасть.НайтиПоИдентификатору(ИдентификаторСтроки);
		ДанныеСтроки[ИмяПоляФизическоеЛицо] = Результат;
		
	КонецЦикла;
	
КонецПроцедуры

//-- НЕ УТ

#КонецОбласти
